package org.example.common.enums;

/**
 * 　　　　　　　　┏┓　　　┏┓+ +
 * 　　　　　　　┏┛┻━━━┛┻┓ + +
 * 　　　　　　　┃　　　　　　　┃
 * 　　　　　　　┃　　　━　　　┃ ++ + + +
 * 　　　　　　 ████━████ ┃+
 * 　　　　　　　┃　　　　　　　┃ +
 * 　　　　　　　┃　　　┻　　　┃
 * 　　　　　　　┃　　　　　　　┃ + +
 * 　　　　　　　┗━┓　　　┏━┛
 * 　　　　　　　　　┃　　　┃
 * 　　　　　　　　　┃　　　┃ + + + +
 * 　　　　　　　　　┃　　　┃　　　　   @Author: wang.yangtx　@Date:  2019-05-15 10:29
 * 　　　　　　　　　┃　　　┃ + 　　　　神兽保佑,代码无bug
 * 　　　　　　　　　┃　　　┃
 * 　　　　　　　　　┃　　　┃　　+
 * 　　　　　　　　　┃　 　　┗━━━┓ + +
 * 　　　　　　　　　┃ 　　　　　　　┣┓
 * 　　　　　　　　　┃ 　　　　　　　┏┛
 * 　　　　　　　　　┗┓┓┏━┳┓┏┛ + + + +
 * 　　　　　　　　　　┃┫┫　┃┫┫
 * 　　　　　　　　　　┗┻┛　┗┻┛+ + + +
 */
public interface ErrCode {
    /**
     * 非法的token
     */
    String E50001 = "50001";
    /**
     * 同一账号同时登陆
     */
    String E50002 = "50002";
    /**
     * token 过期
     */
    String E50003 = "50003";
    /**
     * 用户名或者密码错误
     */
    String E50004 = "50004";
    /**
     * 用户名已经被锁定
     */
    String E50005 = "50005";
    /**
     * 请修改初始密
     */
    String E50006 = "50006";
    /**
     * 未知的异常
     */
    String E10000 = "10000";
    /**
     * 非法的参数
     */
    String E10001 = "10001";
    /**
     * 账号信息不存在
     */
    String E20001 = "20001";
    /**
     * 角色信息不存在
     */
    String E20002 = "20002";
    /**
     * 用户信息不存在
     */
    String E20003 = "20003";

    String E700 = "700";
}
